Autodesk.Revit.DB.Dimension.TextPosition
The position of the dimension text's drag point.
Remarks:
This property is not applicable to all dimensions.
For example, it is not available for spot slope dimensions, multi-segments dimensions,
dimensions using equality formula, and when dimension style is ordinate.
If the position is not applicable, this property throws InvalidOperationException.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2015 Subscription Update

Autodesk.Revit.DB.Dimension.LeaderEndPosition
The position of the dimension's leader end point.
Remarks:
This property is not applicable to all dimensions.
For example, it is not available for spot slope dimensions, multi-segments dimensions,
dimensions using equality formula, and when dimension style is ordinate.
If the position is not applicable, this property throws InvalidOperationException.
Notes for SpotDimension:
This property throws InvalidOperationException if dimension has no leader.Setting of this property works differently for leader with and without shoulder.If leader has shoulder, setting is limited by points on line between leader end and shoulder points (projected point is used).Setting of this property also affects TextPosition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2015 Subscription Update